# Exporting SQL Databases for Tableau

In [1]:
import pandas as pd
import sqlalchemy
from sqlalchemy_utils import create_database, database_exists
import json
import os, glob

# MySQL

In [2]:
import pymysql
pymysql.install_as_MySQLdb()

import pandas as pd
from sqlalchemy import create_engine

In [3]:
## Load in mysql login
import json
with open('/Users/codingdojo/.secret/mysql.json') as f:
    creds = json.load(f)
print(creds.keys())

dict_keys(['user', 'password'])

## Getting List of MySQL Databases (_Not on LP_)

- Use pympysql's connection class & cursor to execute queries

In [4]:
## use pymyswl's .conenct function to make connection
mysql_conn = pymysql.connect(user=creds['user'],
                password=creds['password'])
mysql_conn

In [5]:
# save the cursor from the connection
cur = mysql_conn.cursor()
cur

In [6]:
# use the cursor to execute commands
cur.execute('SHOW DATABASES;')

# must fetch the results in a separate step
res = cur.fetchall()
res

(('BeltExam',),
 ('Chinook',),
 ('data_enrichment_belt.json',),
 ('information_schema',),
 ('mock-belt-exam',),
 ('mock_exam',),
 ('movies',),
 ('movies-ben',),
 ('movies-bijan',),
 ('movies-viz',),
 ('movies_large',),
 ('mysql',),
 ('northwind',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',))

In [7]:
# Making into a flat list
db_names = [d[0] for d in res]
db_names

['BeltExam',
 'Chinook',
 'data_enrichment_belt.json',
 'information_schema',
 'mock-belt-exam',
 'mock_exam',
 'movies',
 'movies-ben',
 'movies-bijan',
 'movies-viz',
 'movies_large',
 'mysql',
 'northwind',
 'performance_schema',
 'sakila',
 'sys',
 'world']

## Loop Through MySQL Databases to Export

In [8]:
## SET FINAL LIST OF DATABSES TO EXPORT & OTHER PARAMS
DB_LIST = ['Chinook','northwind','sakila','world']
CLEAR_FOLDER = True # whether files are deleted from the folder before saving new files

In [9]:
FILES = {}
ERRORS = {}

for DB_NAME in DB_LIST:
    
    dashes = '---'*25

    
    ## connect to the db
    connection_str  = f"mysql+pymysql://{creds['user']}:{creds['password']}@localhost/{DB_NAME}"
    engine = create_engine(connection_str)
    
    # get list of table names
    q = """SHOW TABLES;"""
    tables = pd.read_sql(q, engine)
    table_names = tables[f'Tables_in_{DB_NAME.lower()}'].to_list()
    
    
    ## create folder for saving exported csv's
    folder = f"../Data/{DB_NAME}-mysql/"
    os.makedirs(folder, exist_ok=True)
    
    
    print(dashes,f"    EXPORTING DATABASE ({DB_NAME}) to '{folder}'",dashes,sep='\n')

    if CLEAR_FOLDER:
        print(f"\n[i] Clearing Folder Contents of: '{folder}'\n")
        ## IF REPEATING EXPORT PROCESS
        curr_files = glob.glob(folder+'*')
        if len(curr_files)>0:
            for file in curr_files:
                print(f"  - Deleting '{file}'...")
                os.remove(file)
            print('\n')
                
                
                
    ## Empty list for saving exported file names
    new_files = []
    errors = []

    # Create empty dict for current database
    FILES[DB_NAME] = {}  
    print(f"\n[i] Exporting Tables for {DB_NAME}\n")
    
    for table in table_names:

        try:
            ## Select all from current table
            temp = pd.read_sql(f"SELECT * FROM `{table}`", engine )

            ## save using fname based on table name
            fname = folder+f"{table}.csv"
            temp.to_csv(fname,index=False)

            ## append to new_files
            new_files.append(fname)

            # https://www.geeksforgeeks.org/string-alignment-in-python-f-string/
            print(f"  - Exported {table} to '{fname}'")


        except Exception as e:
            errors.append(table)
#             FILES[DB_NAME][table] = 
            print(f"  - [!] Error with '{table}' table (check ERRORS dictionary)")#,e,'\n')

    ## Save list of errors 
    FILES[DB_NAME] = new_files
    ERRORS[DB_NAME] = errors
    print('\n\n')

---------------------------------------------------------------------------
    EXPORTING DATABASE (Chinook) to '../Data/Chinook-mysql/'
---------------------------------------------------------------------------

[i] Clearing Folder Contents of: '../Data/Chinook-mysql/'

  - Deleting '../Data/Chinook-mysql/PlaylistTrack.csv'...
  - Deleting '../Data/Chinook-mysql/Employee.csv'...
  - Deleting '../Data/Chinook-mysql/Invoice.csv'...
  - Deleting '../Data/Chinook-mysql/Customer.csv'...
  - Deleting '../Data/Chinook-mysql/Artist.csv'...
  - Deleting '../Data/Chinook-mysql/Album.csv'...
  - Deleting '../Data/Chinook-mysql/Genre.csv'...
  - Deleting '../Data/Chinook-mysql/Track.csv'...
  - Deleting '../Data/Chinook-mysql/MediaType.csv'...
  - Deleting '../Data/Chinook-mysql/Playlist.csv'...
  - Deleting '../Data/Chinook-mysql/InvoiceLine.csv'...



[i] Exporting Tables for Chinook

  - Exported Album to '../Data/Chinook-mysql/Album.csv'
  - Exported Artist to '../Data/Chinook-mysql/Artist.csv'
  - Exported Customer to '../Data/Chinook-mysql/Customer.csv'
  - Exported Employee to '../Data/Chinook-mysql/Employee.csv'
  - Exported Genre to '../Data/Chinook-mysql/Genre.csv'
  - Exported Invoice to '../Data/Chinook-mysql/Invoice.csv'
  - Exported InvoiceLine to '../Data/Chinook-mysql/InvoiceLine.csv'
  - Exported MediaType to '../Data/Chinook-mysql/MediaType.csv'
  - Exported Playlist to '../Data/Chinook-mysql/Playlist.csv'
  - Exported PlaylistTrack to '../Data/Chinook-mysql/PlaylistTrack.csv'
  - Exported Track to '../Data/Chinook-mysql/Track.csv'



---------------------------------------------------------------------------
    EXPORTING DATABASE (northwind) to '../Data/northwind-mysql/'
---------------------------------------------------------------------------

[i] Clearing Folder Contents of: '../Data/northwind-mysql/'

  - Deleting '../Data/northwind-mysql/customers.csv'...
  - Deleting '../Data/northwind-mysql/categories.csv'...
  - Deleting '../Data/northwind-mysql/products.csv'...
  - Deleting '../Data/northwind-mysql/order details.csv'...
  - Deleting '../Data/northwind-mysql/orders.csv'...
  - Deleting '../Data/northwind-mysql/suppliers.csv'...
  - Deleting '../Data/northwind-mysql/shippers.csv'...
  - Deleting '../Data/northwind-mysql/employees.csv'...



[i] Exporting Tables for northwind

  - Exported categories to '../Data/northwind-mysql/categories.csv'
  - Exported customers to '../Data/northwind-mysql/customers.csv'
  - Exported employees to '../Data/northwind-mysql/employees.csv'
  - Exported order details to '../Data/northwind-mysql/order details.csv'
  - Exported orders to '../Data/northwind-mysql/orders.csv'
  - Exported products to '../Data/northwind-mysql/products.csv'
  - Exported shippers to '../Data/northwind-mysql/shippers.csv'
  - Exported suppliers to '../Data/northwind-mysql/suppliers.csv'



---------------------------------------------------------------------------
    EXPORTING DATABASE (sakila) to '../Data/sakila-mysql/'
---------------------------------------------------------------------------

[i] Clearing Folder Contents of: '../Data/sakila-mysql/'

  - Deleting '../Data/sakila-mysql/sales_by_film_category.csv'...
  - Deleting '../Data/sakila-mysql/staff.csv'...
  - Deleting '../Data/sakila-mysql/actor.csv'...
  - Deleting '../Data/sakila-mysql/film.csv'...
  - Deleting '../Data/sakila-mysql/film_category.csv'...
  - Deleting '../Data/sakila-mysql/customer.csv'...
  - Deleting '../Data/sakila-mysql/language.csv'...
  - Deleting '../Data/sakila-mysql/staff_list.csv'...
  - Deleting '../Data/sakila-mysql/film_actor.csv'...
  - Deleting '../Data/sakila-mysql/actor_info.csv'...
  - Deleting '../Data/sakila-mysql/address.csv'...
  - Deleting '../Data/sakila-mysql/city.csv'...
  - Deleting '../Data/sakila-mysql/country.csv'...
  - Deleting '../Data/sakila-mysql/payment.csv'...
  - Deleting '../Data/sakila-mysql/customer_list.csv'...
  - Deleting '../Data/sakila-mysql/film_text.csv'...
  - Deleting '../Data/sakila-mysql/sales_by_store.csv'...
  - Deleting '../Data/sakila-mysql/category.csv'...
  - Deleting '../Data/sakila-mysql/rental.csv'...
  - Deleting '../Data/sakila-mysql/store.csv'...
  - Deleting '../Data/sakila-mysql/inventory.csv'...



[i] Exporting Tables for sakila

  - Exported actor to '../Data/sakila-mysql/actor.csv'
  - Exported actor_info to '../Data/sakila-mysql/actor_info.csv'
  - Exported address to '../Data/sakila-mysql/address.csv'
  - Exported category to '../Data/sakila-mysql/category.csv'
  - Exported city to '../Data/sakila-mysql/city.csv'
  - Exported country to '../Data/sakila-mysql/country.csv'
  - Exported customer to '../Data/sakila-mysql/customer.csv'
  - Exported customer_list to '../Data/sakila-mysql/customer_list.csv'
  - Exported film to '../Data/sakila-mysql/film.csv'
  - Exported film_actor to '../Data/sakila-mysql/film_actor.csv'
  - Exported film_category to '../Data/sakila-mysql/film_category.csv'
  - [!] Error with 'film_list' table (check ERRORS dictionary)
  - Exported film_text to '../Data/sakila-mysql/film_text.csv'
  - Exported inventory to '../Data/sakila-mysql/inventory.csv'
  - Exported language to '../Data/sakila-mysql/language.csv'
  - [!] Error with 'nicer_but_slower_film_list' table (check ERRORS dictionary)
  - Exported payment to '../Data/sakila-mysql/payment.csv'
  - Exported rental to '../Data/sakila-mysql/rental.csv'
  - Exported sales_by_film_category to '../Data/sakila-mysql/sales_by_film_category.csv'
  - Exported sales_by_store to '../Data/sakila-mysql/sales_by_store.csv'
  - Exported staff to '../Data/sakila-mysql/staff.csv'
  - Exported staff_list to '../Data/sakila-mysql/staff_list.csv'
  - Exported store to '../Data/sakila-mysql/store.csv'



---------------------------------------------------------------------------
    EXPORTING DATABASE (world) to '../Data/world-mysql/'
---------------------------------------------------------------------------

[i] Clearing Folder Contents of: '../Data/world-mysql/'

  - Deleting '../Data/world-mysql/countries.csv'...
  - Deleting '../Data/world-mysql/cities.csv'...
  - Deleting '../Data/world-mysql/languages.csv'...



[i] Exporting Tables for world

  - Exported cities to '../Data/world-mysql/cities.csv'
  - Exported countries to '../Data/world-mysql/countries.csv'
  - Exported languages to '../Data/world-mysql/languages.csv'

# SQLITE 3

## Northwind.db

### Connect to .db file and get table names

In [10]:
import sqlite3

- Source: https://github.com/jpwhite3/northwind-SQLite3

In [11]:
# use sqlite3 to connect to sqlite3 .db
conn = sqlite3.connect('SQL/northwind.db')
conn

In [12]:
# Get list of table names (Equivalent to SHOW TABLES)
tables = pd.read_sql("SELECT * from sqlite_master WHERE type='table'", conn)
tables

,type,name,tbl_name,rootpage,sql
0,table,Categories,Categories,2,CREATE TABLE [Categories]\n( [CategoryID]...
1,table,sqlite_sequence,sqlite_sequence,3,"CREATE TABLE sqlite_sequence(name,seq)"
2,table,CustomerCustomerDemo,CustomerCustomerDemo,28,CREATE TABLE [CustomerCustomerDemo](\n [Cust...
3,table,CustomerDemographics,CustomerDemographics,30,CREATE TABLE [CustomerDemographics](\n [Cust...
4,table,Customers,Customers,32,CREATE TABLE [Customers]\n( [CustomerID] ...
5,table,Employees,Employees,37,CREATE TABLE [Employees]\n( [EmployeeID] ...
6,table,EmployeeTerritories,EmployeeTerritories,67,CREATE TABLE [EmployeeTerritories](\n [Emplo...
7,table,Order Details,Order Details,69,CREATE TABLE [Order Details](\n [OrderID]INT...
8,table,Orders,Orders,91,CREATE TABLE [Orders](\n [OrderID]INTEGER NO...
9,table,Products,Products,127,CREATE TABLE [Products](\n [ProductID]INTEGE...
10,table,Regions,Regions,131,CREATE TABLE [Regions](\n [RegionID]INTEGER ...
11,table,Shippers,Shippers,132,CREATE TABLE [Shippers](\n [ShipperID]INTEGE...
12,table,Suppliers,Suppliers,133,CREATE TABLE [Suppliers](\n [SupplierID]INTE...
13,table,Territories,Territories,134,CREATE TABLE [Territories](\n [TerritoryID]T...

In [13]:
# save list of tables for loop
table_names = tables['name'].tolist()
table_names

['Categories',
 'sqlite_sequence',
 'CustomerCustomerDemo',
 'CustomerDemographics',
 'Customers',
 'Employees',
 'EmployeeTerritories',
 'Order Details',
 'Orders',
 'Products',
 'Regions',
 'Shippers',
 'Suppliers',
 'Territories']

> Saw farther down that the customer demographics tables are empty. So we are removing them here.

In [14]:
table_names.remove('CustomerCustomerDemo')
table_names.remove('CustomerDemographics')
table_names.remove('sqlite_sequence')
table_names

['Categories',
 'Customers',
 'Employees',
 'EmployeeTerritories',
 'Order Details',
 'Orders',
 'Products',
 'Regions',
 'Shippers',
 'Suppliers',
 'Territories']

### Loop to Extract Tables and Save to Disk

In [15]:
## create folder for saving exported csv's
folder = "../Data/Northwind-sqlite/"
os.makedirs(folder, exist_ok=True)

In [16]:
## IF REPEATING EXPORT PROCESS
curr_files = glob.glob(folder+'*')
curr_files

['../Data/Northwind-sqlite/Customers.csv',
 '../Data/Northwind-sqlite/Categories.csv',
 '../Data/Northwind-sqlite/Regions.csv',
 '../Data/Northwind-sqlite/Products.csv',
 '../Data/Northwind-sqlite/Order Details.csv',
 '../Data/Northwind-sqlite/Orders.csv',
 '../Data/Northwind-sqlite/Suppliers.csv',
 '../Data/Northwind-sqlite/Shippers.csv',
 '../Data/Northwind-sqlite/Territories.csv',
 '../Data/Northwind-sqlite/Employees.csv',
 '../Data/Northwind-sqlite/EmployeeTerritories.csv']

In [17]:
## IF REPEATING EXPORT PROCESS
if len(curr_files)>0:
    for file in curr_files:
        os.remove(file)
        
os.listdir(folder)

[]

In [18]:
## Empty list for saving exported file names
new_files = []


for table in table_names:
    
    ## Select all from current table
    temp = pd.read_sql(f"SELECT * FROM `{table}`", conn )

    ## save using fname based on table name
    fname = folder+f"{table}.csv"
    temp.to_csv(fname,index=False)
    
    ## append to new_files
    new_files.append(fname)
    
    # https://www.geeksforgeeks.org/string-alignment-in-python-f-string/
    print(f"- Exported {table} to {fname}")


len(new_files)

- Exported Categories to ../Data/Northwind-sqlite/Categories.csv
- Exported Customers to ../Data/Northwind-sqlite/Customers.csv
- Exported Employees to ../Data/Northwind-sqlite/Employees.csv
- Exported EmployeeTerritories to ../Data/Northwind-sqlite/EmployeeTerritories.csv
- Exported Order Details to ../Data/Northwind-sqlite/Order Details.csv
- Exported Orders to ../Data/Northwind-sqlite/Orders.csv
- Exported Products to ../Data/Northwind-sqlite/Products.csv
- Exported Regions to ../Data/Northwind-sqlite/Regions.csv
- Exported Shippers to ../Data/Northwind-sqlite/Shippers.csv
- Exported Suppliers to ../Data/Northwind-sqlite/Suppliers.csv
- Exported Territories to ../Data/Northwind-sqlite/Territories.csv

11

### Preview Saved Tables

In [19]:
## Loop through the list of files created
for file in new_files:
    
    ## Print file name, display .head() and .tail()
    print(file)    
    temp_df = pd.read_csv(file)
    display(temp_df.head(), temp_df.tail())
    
    print('\n\n')

../Data/Northwind-sqlite/Categories.csv

,CategoryID,CategoryName,Description,Picture
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an...",b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
2,3,Confections,"Desserts, candies, and sweet breads",b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
3,4,Dairy Products,Cheeses,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal",b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...

,CategoryID,CategoryName,Description,Picture
3,4,Dairy Products,Cheeses,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal",b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
5,6,Meat/Poultry,Prepared meats,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
6,7,Produce,Dried fruit and bean curd,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...
7,8,Seafood,Seaweed and fish,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...

../Data/Northwind-sqlite/Customers.csv

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,Western Europe,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,Central America,05021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,Central America,05023,Mexico,(5) 555-3932,NaN
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,British Isles,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,Northern Europe,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
88,WARTH,Wartian Herkku,Pirkko Koskitalo,Accounting Manager,Torikatu 38,Oulu,Scandinavia,90110,Finland,981-443655,981-443655
89,WELLI,Wellington Importadora,Paula Parente,Sales Manager,"Rua do Mercado, 12",Resende,South America,08737-363,Brazil,(14) 555-8122,NaN
90,WHITC,White Clover Markets,Karl Jablonski,Owner,305 - 14th Ave. S. Suite 3B,Seattle,North America,98128,USA,(206) 555-4112,(206) 555-4115
91,WILMK,Wilman Kala,Matti Karttunen,Owner/Marketing Assistant,Keskuskatu 45,Helsinki,Scandinavia,21240,Finland,90-224 8858,90-224 8858
92,WOLZA,Wolski Zajazd,Zbyszek Piestrzeniewicz,Owner,ul. Filtrowa 68,Warszawa,Eastern Europe,01-012,Poland,(26) 642-7012,(26) 642-7012

../Data/Northwind-sqlite/Employees.csv

,EmployeeID,LastName,FirstName,Title,TitleOfCourtesy,BirthDate,HireDate,Address,City,Region,PostalCode,Country,HomePhone,Extension,Photo,Notes,ReportsTo,PhotoPath
0,1,Davolio,Nancy,Sales Representative,Ms.,1968-12-08,2012-05-01,507 - 20th Ave. E.Apt. 2A,Seattle,North America,98122,USA,(206) 555-9857,5467,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Education includes a BA in psychology from Col...,2.0,http://accweb/emmployees/davolio.bmp
1,2,Fuller,Andrew,"Vice President, Sales",Dr.,1972-02-19,2012-08-14,908 W. Capital Way,Tacoma,North America,98401,USA,(206) 555-9482,3457,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Andrew received his BTS commercial in 1974 and...,NaN,http://accweb/emmployees/fuller.bmp
2,3,Leverling,Janet,Sales Representative,Ms.,1983-08-30,2012-04-01,722 Moss Bay Blvd.,Kirkland,North America,98033,USA,(206) 555-3412,3355,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Janet has a BS degree in chemistry from Boston...,2.0,http://accweb/emmployees/leverling.bmp
3,4,Peacock,Margaret,Sales Representative,Mrs.,1957-09-19,2013-05-03,4110 Old Redmond Rd.,Redmond,North America,98052,USA,(206) 555-8122,5176,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Margaret holds a BA in English literature from...,2.0,http://accweb/emmployees/peacock.bmp
4,5,Buchanan,Steven,Sales Manager,Mr.,1975-03-04,2013-10-17,14 Garrett Hill,London,British Isles,SW1 8JR,UK,(71) 555-4848,3453,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Steven Buchanan graduated from St. Andrews Uni...,2.0,http://accweb/emmployees/buchanan.bmp

,EmployeeID,LastName,FirstName,Title,TitleOfCourtesy,BirthDate,HireDate,Address,City,Region,PostalCode,Country,HomePhone,Extension,Photo,Notes,ReportsTo,PhotoPath
4,5,Buchanan,Steven,Sales Manager,Mr.,1975-03-04,2013-10-17,14 Garrett Hill,London,British Isles,SW1 8JR,UK,(71) 555-4848,3453,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Steven Buchanan graduated from St. Andrews Uni...,2.0,http://accweb/emmployees/buchanan.bmp
5,6,Suyama,Michael,Sales Representative,Mr.,1983-07-02,2013-10-17,Coventry House\nMiner Rd.,London,British Isles,EC2 7JR,UK,(71) 555-7773,428,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Michael is a graduate of Sussex University (MA...,5.0,http://accweb/emmployees/davolio.bmp
6,7,King,Robert,Sales Representative,Mr.,1980-05-29,2014-01-02,Edgeham Hollow\nWinchester Way,London,British Isles,RG1 9SP,UK,(71) 555-5598,465,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Robert King served in the Peace Corps and trav...,5.0,http://accweb/emmployees/davolio.bmp
7,8,Callahan,Laura,Inside Sales Coordinator,Ms.,1978-01-09,2014-03-05,4726 - 11th Ave. N.E.,Seattle,North America,98105,USA,(206) 555-1189,2344,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Laura received a BA in psychology from the Uni...,2.0,http://accweb/emmployees/davolio.bmp
8,9,Dodsworth,Anne,Sales Representative,Ms.,1986-01-27,2014-11-15,7 Houndstooth Rd.,London,British Isles,WG2 7LT,UK,(71) 555-4444,452,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Anne has a BA degree in English from St. Lawre...,5.0,http://accweb/emmployees/davolio.bmp

../Data/Northwind-sqlite/EmployeeTerritories.csv

   EmployeeID  TerritoryID
0           1         6897
1           1        19713
2           2         1581
3           2         1730
4           2         1833

    EmployeeID  TerritoryID
44           9        48075
45           9        48084
46           9        48304
47           9        55113
48           9        55439

../Data/Northwind-sqlite/Order Details.csv

   OrderID  ProductID  UnitPrice  Quantity  Discount
0    10248         11       14.0        12       0.0
1    10248         42        9.8        10       0.0
2    10248         72       34.8         5       0.0
3    10249         14       18.6         9       0.0
4    10249         51       42.4        40       0.0

      OrderID  ProductID  UnitPrice  Quantity  Discount
2150    11077         64      33.25         2      0.03
2151    11077         66      17.00         1      0.00
2152    11077         73      15.00         2      0.01
2153    11077         75       7.75         4      0.00
2154    11077         77      13.00         2      0.00

../Data/Northwind-sqlite/Orders.csv

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,2016-07-04,2016-08-01,2016-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l-Abbaye,Reims,Western Europe,51100,France
1,10249,TOMSP,6,2016-07-05,2016-08-16,2016-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,Western Europe,44087,Germany
2,10250,HANAR,4,2016-07-08,2016-08-05,2016-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,South America,05454-876,Brazil
3,10251,VICTE,3,2016-07-08,2016-08-05,2016-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,Western Europe,69004,France
4,10252,SUPRD,4,2016-07-09,2016-08-06,2016-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,Western Europe,B-6000,Belgium

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
825,11073,PERIC,2,2018-05-05,2018-06-02,NaN,2,24.95,Pericles Comidas clásicas,Calle Dr. Jorge Cash 321,México D.F.,Central America,5033,Mexico
826,11074,SIMOB,7,2018-05-06,2018-06-03,NaN,2,18.44,Simons bistro,Vinbæltet 34,Kobenhavn,Northern Europe,1734,Denmark
827,11075,RICSU,8,2018-05-06,2018-06-03,NaN,2,6.19,Richter Supermarkt,Starenweg 5,Genève,Western Europe,1204,Switzerland
828,11076,BONAP,4,2018-05-06,2018-06-03,NaN,2,38.28,Bon app-,"12, rue des Bouchers",Marseille,Western Europe,13008,France
829,11077,RATTC,1,2018-05-06,2018-06-03,NaN,2,8.53,Rattlesnake Canyon Grocery,2817 Milton Dr.,Albuquerque,North America,87110,USA

../Data/Northwind-sqlite/Products.csv

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18.00,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,19.00,17,40,25,0
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.00,13,70,25,0
3,4,Chef Anton's Cajun Seasoning,2,2,48 - 6 oz jars,22.00,53,0,0,0
4,5,Chef Anton's Gumbo Mix,2,2,36 boxes,21.35,0,0,0,1

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
72,73,Röd Kaviar,17,8,24 - 150 g jars,15.00,101,0,5,0
73,74,Longlife Tofu,4,7,5 kg pkg.,10.00,4,20,5,0
74,75,Rhönbräu Klosterbier,12,1,24 - 0.5 l bottles,7.75,125,0,25,0
75,76,Lakkalikööri,23,1,500 ml,18.00,57,0,20,0
76,77,Original Frankfurter grüne Soße,12,2,12 boxes,13.00,32,0,15,0

../Data/Northwind-sqlite/Regions.csv

   RegionID                                  RegionDescription
0         1  Eastern                                       ...
1         2  Westerns                                      ...
2         3  Northern                                      ...
3         4  Southern                                      ...

   RegionID                                  RegionDescription
0         1  Eastern                                       ...
1         2  Westerns                                      ...
2         3  Northern                                      ...
3         4  Southern                                      ...

../Data/Northwind-sqlite/Shippers.csv

   ShipperID       CompanyName           Phone
0          1    Speedy Express  (503) 555-9831
1          2    United Package  (503) 555-3199
2          3  Federal Shipping  (503) 555-9931

   ShipperID       CompanyName           Phone
0          1    Speedy Express  (503) 555-9831
1          2    United Package  (503) 555-3199
2          3  Federal Shipping  (503) 555-9931

../Data/Northwind-sqlite/Suppliers.csv

,SupplierID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax,HomePage
0,1,Exotic Liquids,Charlotte Cooper,Purchasing Manager,49 Gilbert St.,London,British Isles,EC1 4SD,UK,(171) 555-2222,NaN,NaN
1,2,New Orleans Cajun Delights,Shelley Burke,Order Administrator,P.O. Box 78934,New Orleans,North America,70117,USA,(100) 555-4822,NaN,#CAJUN.HTM#
2,3,Grandma Kelly's Homestead,Regina Murphy,Sales Representative,707 Oxford Rd.,Ann Arbor,North America,48104,USA,(313) 555-5735,(313) 555-3349,NaN
3,4,Tokyo Traders,Yoshi Nagase,Marketing Manager,9-8 Sekimai\nMusashino-shi,Tokyo,Eastern Asia,100,Japan,(03) 3555-5011,NaN,NaN
4,5,Cooperativa de Quesos 'Las Cabras',Antonio del Valle Saavedra,Export Administrator,Calle del Rosal 4,Oviedo,Southern Europe,33007,Spain,(98) 598 76 54,NaN,NaN

,SupplierID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax,HomePage
24,25,Ma Maison,Jean-Guy Lauzon,Marketing Manager,2960 Rue St. Laurent,Montréal,North America,H1J 1C3,Canada,(514) 555-9022,NaN,NaN
25,26,Pasta Buttini s.r.l.,Giovanni Giudici,Order Administrator,"Via dei Gelsomini, 153",Salerno,Southern Europe,84100,Italy,(089) 6547665,(089) 6547667,NaN
26,27,Escargots Nouveaux,Marie Delamare,Sales Manager,"22, rue H. Voiron",Montceau,Western Europe,71300,France,85.57.00.07,NaN,NaN
27,28,Gai pâturage,Eliane Noz,Sales Representative,"Bat. B\n3, rue des Alpes",Annecy,Western Europe,74000,France,38.76.98.06,38.76.98.58,NaN
28,29,Forêts d'érables,Chantal Goulet,Accounting Manager,148 rue Chasseur,Ste-Hyacinthe,North America,J2S 7S8,Canada,(514) 555-2955,(514) 555-2921,NaN

../Data/Northwind-sqlite/Territories.csv

   TerritoryID                               TerritoryDescription  RegionID
0         1581  Westboro                                      ...         1
1         1730  Bedford                                       ...         1
2         1833  Georgetow                                     ...         1
3         2116  Boston                                        ...         1
4         2139  Cambridge                                     ...         1

    TerritoryID                               TerritoryDescription  RegionID
48        95054  Santa Clara                                   ...         2
49        95060  Santa Cruz                                    ...         2
50        98004  Bellevue                                      ...         2
51        98052  Redmond                                       ...         2
52        98104  Seattle                                       ...         2

# APPENDIX

In [20]:
raise Exception("Stop here.")

Exception: Stop here.

## Sakila (test case before loop)

### Connect to MySQL Server and Get Table Names

In [ ]:
# DB_NAME = 'sakila'

In [ ]:
# connection_str  = f"mysql+pymysql://{creds['user']}:{creds['password']}@localhost/{DB_NAME}"
# engine = create_engine(connection_str)
# database_exists(connection_str)

In [ ]:
# ## sanity check to make sur econnection worked (NOT REQUIRED)
# q = """SHOW TABLES;"""
# tables = pd.read_sql(q, engine)
# tables

In [ ]:
# table_names = tables[f'Tables_in_{DB_NAME}'].to_list()
# table_names

### Loop to Extract Tables and Save to Disk

In [ ]:
# ## create folder for saving exported csv's
# folder = f"../Data/{DB_NAME}-mysql/"
# os.makedirs(folder, exist_ok=True)

In [ ]:
# ## IF REPEATING EXPORT PROCESS
# curr_files = glob.glob(folder+'*')
# curr_files

In [ ]:
# ## IF REPEATING EXPORT PROCESS
# if len(curr_files)>0:
#     for file in curr_files:
#         os.remove(file)
        
# os.listdir(folder)

In [ ]:
# ## Empty list for saving exported file names
# new_files = []
# errors = []

# for table in table_names:
    
#     try:
#         ## Select all from current table
#         temp = pd.read_sql(f"SELECT * FROM {table}", engine )

#         ## save using fname based on table name
#         fname = folder+f"{table}.csv"
#         temp.to_csv(fname,index=False)

#         ## append to new_files
#         new_files.append(fname)

#         # https://www.geeksforgeeks.org/string-alignment-in-python-f-string/
#         print(f"- Exported {table} to {fname}")
#     except Exception as e:
#         errors.append(table)
#         print(f"\n! Error with {table} table:\t",e,'\n')


# len(new_files)

In [ ]:
#   errors

- These are not tables shown in MySQL Workbench, so it is ok that they are causing an error here.